.site/content/bridge-roles-and-agencies.md
+++
title = "Bridge Roles and Agencies"
author = ["James"]
date = 2026-01-18T15:43:00+00:00
draft = false
+++

## Recruitment Agencies {#recruitment-agencies}

It's in my best interest to contact these agencies directly with a new project-focusd resume.


### LinuxRecruit {#linuxrecruit}

-   **Focus:** Specialized leader in Linux, Cloud, and DevOps.
-   **Why:** They often have "Junior Linux Admin" roles not advertised on main boards.
-   **Link:** [LinuxRecruit Website](https://www.linuxrecruit.co.uk/)


### Client Server {#client-server}

-   **Focus:** Technical recruitment for London fintechs and high-growth startups.
-   **Why:** Good for finding junior roles in environments that value hands-on lab work.
-   **Link:** [Client Server Website](https://www.client-server.com/)


### Hays Technology {#hays-technology}

-   **Focus:** Broad IT support and infrastructure across the UK.
-   **Why:** Excellent for 1st Line Support roles with "guaranteed progression" tracks.
-   **Link:** [Hays IT Website](https://www.hays.co.uk/it)


### Langley James {#langley-james}

-   **Focus:** London-based IT recruitment specialist since 1999.
-   **Why:** Recruits across all sectors, from juniors to senior management.
-   **Link:** [Langley James Website](https://www.langleyjames.com/)


## Live Bridge Roles (JANUARY 2026) {#live-bridge-roles--january-2026}

These roles pay a full salary and are currently active.


### 1st Line IT Engineer | Hays Technology {#1st-line-it-engineer-hays-technology}

-   **Salary:** £26,000 - £29,000
-   **Location:** City of London (EC1) / Hybrid
-   **Profile:** Entry-level role requiring ~6 months of customer/ticket experience.
-   **Progression:** Guaranteed path to 2nd and 3rd line senior support.
-   **Link:** [Apply at Hays](https://talents.studysmarter.co.uk/companies/hays-technology/london/1st-line-it-engineer-21720290/)


### Junior Linux Systems Administrator | Quant Capital {#junior-linux-systems-administrator-quant-capital}

-   **Salary:** Up to £35,000 + bonus
-   **Location:** London (Retail Trading Business)
-   **Profile:** Focuses on Linux infrastructure support and monitoring critical systems.
-   **Why:** Matches your hands-on Arch/Rocky Linux build experience.
-   **Link:** [Apply at Quant Capital](https://www.quant-capital.co.uk/jobs/junior-linux-systems-administrator/)


### Trainee IT Support Analyst | Nxstep Recruitment {#trainee-it-support-analyst-nxstep-recruitment}

-   **Salary:** £25,000 - £30,000
-   **Location:** London / Hybrid Remote
-   **Profile:** Ideal for individuals starting an IT career; no prior commercial experience required.
-   **Link:** [Apply at Nxstep](https://findajob.dwp.gov.uk/details/17679190)


### IT Support Trainee | United Colleges Group {#it-support-trainee-united-colleges-group}

-   **Salary:** £27,050 - £28,383
-   **Location:** London (W2) / On-site
-   **Profile:** Providing first-line support while receiving training for progression.
-   **Link:** [Apply at UCG](https://findajob.dwp.gov.uk/details/17669361)


## Strategic Application Tips {#strategic-application-tips}

-   ****The M&amp;S Leverage:**** Always highlight your 7 years of service experience in your opening sentence. It proves you are reliable and can handle high-pressure user environments.
-   ****Project over Degree:**** Since you left your degree, lead with your `growing-wiki` and `dotfiles` projects. These prove you have the _skills_ the degree was supposed to teach.
-   ****Remote-First Boards:**** Ensure you have active profiles on [Otta](https://otta.com/) and [Cord](https://cord.co/), as they prioritize technical proficiency and personal projects.
